In [1]:
import selenium
from selenium import webdriver
from selenium.webdriver.common.by import By
import pandas as pd
import re
import time
import warnings
warnings.filterwarnings('ignore')

In [2]:
# Opening Automated chrome browser
driver=webdriver.Chrome()

Q1: In this question you have to scrape data using the filters available on the webpage You have to use the location and 
salary filter.  
You have to scrape data for “Data Scientist” designation for first 10 job results.  
You have to scrape the job-title, job-location, company name, experience required.  
The location filter to be used is “Delhi/NCR”. The salary filter to be used is “3-6” lakhs  
The task will be done as shown in the below steps:  
1. first get the web page https://www.naukri.com/ 
2. Enter “Data Scientist” in “Skill, Designations, and Companies” field.  
3. Then click the search button.  
4. Then apply the location filter and salary filter by checking the respective boxes  
5. Then scrape the data for the first 10 jobs results you get.  
6. Finally create a dataframe of the scraped data.

In [3]:
# Opening naukri.com on automated chrome browser
driver.get('https://www.naukri.com/')

In [4]:
#searching for data scientist roles
designation=driver.find_element(By.CLASS_NAME,"suggestor-input ")
designation.send_keys('Data Scientist')
search=driver.find_element(By.CLASS_NAME,"qsbSubmit")
search.click()

In [5]:
# Applying the Location Filter
Delhi_NCR=driver.find_element(By.XPATH,'//label[@for="chk-Delhi / NCR-cityTypeGid-"]/i')
Delhi_NCR.click()

In [6]:
# Applying the Salary Filter
three_to_six_lakhs=driver.find_element(By.XPATH,'//label[@for="chk-3-6 Lakhs-ctcFilter-"]/i')
three_to_six_lakhs.click()

In [7]:
#Scraping the data from the jobs result

# Creating empty list to store the scraped data
title=[]
location=[]
company=[]
experience=[]

# Scraping job_title of first 10 jobs results
title_tag=driver.find_elements(By.XPATH,'//div[@class="cust-job-tuple layout-wrapper lay-2 sjw__tuple "]/div/a')
for t in title_tag[0:10]:
    title.append(t.text)

# Scraping Job_Location of first 10 jobs results
location_tag=driver.find_elements(By.XPATH,'//span[@class="ni-job-tuple-icon ni-job-tuple-icon-srp-location loc"]')
for l in location_tag[0:10]:
    location.append(l.text)

# Scraping Company name of first 10 jobs results
company_tag=driver.find_elements(By.XPATH,'//span[@class=" comp-dtls-wrap"]/a[1]')
for c in company_tag[0:10]:
    company.append(re.sub('\n.*','',c.text))

# Scraping Experience Requirment for first 10 jobs results
exp_tag=driver.find_elements(By.XPATH,'//span[@class="ni-job-tuple-icon ni-job-tuple-icon-srp-experience exp"]')
for e in exp_tag[0:10]:
    experience.append(e.text)

print(len(title),len(location),len(company),len(experience))

10 10 10 10

In [8]:
#Creating dataframe of scraped data from naukri.com
df=pd.DataFrame({'Job-title':title,'Job-location':location,'Company Name':company,'Experience Required':experience})
df

,Job-title,Job-location,Company Name,Experience Required
0,Data Scientist HTHD,"Kolkata, Mumbai, New Delhi, Hyderabad, Pune, C...",Ford,1-4 Yrs
1,Data Scientist,"Gurugram, Bengaluru",Blackbuck,3-7 Yrs
2,"Data Scientist - NLP, Gen AI",Noida,R Systems International,5-8 Yrs
3,Associate Scientist - Data Sourcing & Solutions,Gurugram,Axa Technology Services,1-4 Yrs
4,Global GI Data Scientist,Faridabad,Hitachi Ltd.,3-5 Yrs
5,Data Scientist,"Kolkata, Mumbai, New Delhi, Hyderabad, Pune, C...",Digital Glyde,3-7 Yrs
6,Python Data Scientist,"Kolkata, Mumbai, New Delhi, Hyderabad, Pune, C...",Wizaltia Hr Solutions,2-7 Yrs
7,Data Scientist,"Kolkata, Mumbai, New Delhi, Hyderabad, Pune, C...",Kmart,3-5 Yrs
8,Data Scientist,"Kolkata, Mumbai, New Delhi, Hyderabad, Pune, C...",KAS Services,3-5 Yrs
9,Data Scientist,"Kolkata, Mumbai, New Delhi, Hyderabad, Pune, C...",Scienaptic Systems,2-7 Yrs

Q2: Write a python program to scrape data for “Data Scientist” Job position in “Bangalore” location. You have to scrape the 
job-title, job-location, company_name, experience_required. You have to scrape first 10 jobs data. 
This task will be done in following steps: 
1. First get the webpage https://www.shine.com/ 
2. Enter “Data Analyst” in “Job title, Skills” field and enter “Bangalore” in “enter the location” field. 
3. Then click the searchbutton.  
4. Then scrape the data for the first 10 jobs results you get.  
5. Finally create a dataframe of the scraped data.

In [9]:
#Opening shine.com on automated chrome browser
driver.get('https://www.shine.com/')

In [15]:
# Searching for Data Analyst role in Bangalore on shine.com

# Entering job_title
designation=driver.find_element(By.XPATH,'//li[@class="searchForm_search_item__hr6Du form-group "]/div/input')
designation.send_keys('Data Analyst')

# Entering Job_location
loc=driver.find_element(By.ID,"id_loc")
loc.send_keys('Bangalore')

In [16]:
#Clicking on Search Button
search=driver.find_element(By.XPATH,'//div[@class="searchForm_btnWrap__Cb75F"]/div/button')
search.click()

In [18]:
# Scraping data of search results for data analyst role in bangalore on shine.com

#Creating Empty Lists to store the scraped data
j_title=[]
j_location=[]
comp_name=[]
exp_reqr=[]

#Scraping job title of first 10 jobs results
title_tag=driver.find_elements(By.XPATH,'//strong[@class="jobCard_pReplaceH2__xWmHg"]')
for t in title_tag[0:10]:
    j_title.append(t.text)

# Scraping location of first 10 jobs results
loc_tag=driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_locationIcon__zrWt2"]')
for l in loc_tag[0:10]:
    j_location.append(re.sub('\n.*','',l.text))

#Scraping company name of first 10 jobs results
comp_tag=driver.find_elements(By.XPATH,'//div[@class="jobCard_jobCard_cName__mYnow"]')
for c in comp_tag[0:10]:
    comp_name.append(c.text)

# Scraping Experience Requirement for first 10 jobs results
exp_tag=driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_jobIcon__3FB1t"]')
for e in exp_tag[0:10]:
    exp_reqr.append(e.text)

print(len(j_title),len(j_location),len(comp_name),len(exp_reqr))

10 10 10 10

In [19]:
# Creating DataFrame of Scraped data from shine.com
df=pd.DataFrame({'Job-title':j_title,'Job-location':j_location,'Company Name':comp_name,'Experience Required':exp_reqr})
df

,Job-title,Job-location,Company Name,Experience Required
0,"Data Analyst , Senior Data Analyst , Data Anal...",Bangalore,appsoft solutions,0 to 4 Yrs
1,Data Analyst,Bangalore,valenta bpo solutions pvt. ltd.,4 to 5 Yrs
2,"Data Analyst (Power BI, Python, SQL)- Internal...",Bangalore,talent leads hr solutions pvt ltd,3 to 8 Yrs
3,Clinical Data Analyst,Bangalore,techno endura,0 to 1 Yr
4,Data Analyst Fresher and Experience Vacancy,Bangalore,radhika enterprises,0 to 4 Yrs
5,Data Analyst Opening,Bangalore,radhika enterprises,0 to 4 Yrs
6,Data Analyst Recruitment,Bangalore,radhika enterprises,0 to 4 Yrs
7,Data Analyst Recruitment,Bangalore,radhika enterprises,0 to 4 Yrs
8,Business Analyst,Bangalore,mackenzie modern it solutions priva...,4 to 6 Yrs
9,MIS Analyst,Bangalore,quess corp (magna infotech),8 to 13 Yrs

Q3: Scrape 100 reviews data from flipkart.com for iphone11 phone. You have to go the link: 
https://www.flipkart.com/apple-iphone-11-black-64-gb/product
reviews/itm4e5041ba101fd?pid=MOBFWQ6BXGJCEYNY&lid=LSTMOBFWQ6BXGJCEYNYZXSHRJ&marketplace=
 LIPKAT

In [20]:
# Opening iphone 11 review page on flipkart.com
driver.get('https://www.flipkart.com/apple-iphone-11-black-64-gb/product-reviews/itm4e5041ba101fd?pid=MOBFWQ6BXGJCEYNY&lid=LSTMOBFWQ6BXGJCEYNYZXSHRJ&marketplace=FLIPKART')

In [21]:
# Scraping the  100 reviews for iphone 11 on flipkart.com

# Creating Empty lists to store scraped data
rating=[]
r_summary=[]
full_review=[]

# Creating a for loop to scrap data from 10 pages
for i in range(0,10):
    rating_tag=driver.find_elements(By.XPATH,'//div[@class="XQDdHH Ga3i8K"]') # Scraping ratings of the product
    for r in rating_tag:
        rating.append(r.text)

    summary_tag=driver.find_elements(By.XPATH,'//p[@class="z9E0IG"]')  # Scraping review summary of the product
    for s in summary_tag:
        r_summary.append(s.text)

    fullreview_tag=driver.find_elements(By.XPATH,'//div[@class="ZmyHeo"]') # Scraping full review of the product
    for f in fullreview_tag:
        full_review.append(f.text.replace('\n',' '))

    next=driver.find_element(By.CLASS_NAME,"_9QVEpD") #Moving on to the next page
    next.click()
    time.sleep(5)

print(len(rating),len(r_summary),len(full_review))

100 100 100

In [22]:
# Creating DataFrame of the Scraped data from flipkart
df=pd.DataFrame({'Rating':rating,'Review-Summary':r_summary,'Full-Review':full_review})
df

,Rating,Review-Summary,Full-Review
0,5,Classy product,Camera is awesome Best battery backup A perfor...
1,5,Terrific,Very very good
2,5,Wonderful,This is amazing at all
3,5,Worth every penny,Feeling awesome after getting the delivery of ...
4,5,Best in the market!,Good Camera
...,...,...,...
95,5,Awesome,iPhone 11 is a good phone. Not a very big diff...
96,5,Super!,Good product 👌I love iPhone
97,5,Brilliant,Excellent Phone.
98,5,Must buy!,"Go for iPhone 11 , if confused between iPhone ..."
99,5,Best in the market!,Superbb performance n camera is awesome 😍😍

Q4: Scrape data for first 100 sneakers you find when you visit flipkart.com and search for “sneakers” in the search 
field. 
You have to scrape 3 attributes of each sneaker: 
1. Brand 
2. Product Description 
3. Price

In [23]:
# Opening flipkart on automated chrome browser

driver.get('https://www.flipkart.com/')

In [27]:
# Searching sneakers on flipkart
product_field=driver.find_element(By.CLASS_NAME,"Pke_EE")
product_field.send_keys('sneakers')

In [28]:
# Click on search
search=driver.find_element(By.CLASS_NAME,"_2iLD__")
search.click()

In [29]:
# Scraping first 100 data of the sneakers search result on flipkart

# creating blank list to store the scraped data
brand=[]
product_descr=[]
price=[]

# scraping data from first 3 pages
for i in range(0,3):
    brand_tag=driver.find_elements(By.XPATH,'//div[@class="syl9yP"]') # Scraping brand name of the product
    for b in brand_tag:
        brand.append(b.text)

    descr_tag=driver.find_elements(By.XPATH,'//div[@class="hCKiGj"]/a[1]') # Scraping product description
    for d in descr_tag:
        product_descr.append(d.text)

    price_tag=driver.find_elements(By.XPATH,'//div[@class="Nx9bqj"]') # Scraping Price of the product
    for p in price_tag:
        price.append(p.text.replace('₹',''))

    next=driver.find_element(By.CLASS_NAME,"_9QVEpD")
    next.click() # Moving on to the next page
    time.sleep(10)

print(len(brand),len(product_descr),len(price))

120 120 118

In [30]:
# Creating DataFrame of first 100 scraped data from flipkart
df=pd.DataFrame({'Brand':brand[0:100],'Product-description':product_descr[0:100],'Price(₹)':price[0:100]})
df

           Brand                                Product-description Price(₹)
0        ROASTER  Stylish Multi Sports Casual Sneaker Shoes Snea...      317
1      Deals4you                                 Sneakers For Women      378
2       URBANBOX  Trending Stylish Casual Outdoor Shoes Sneakers...      299
3         Shozie         Stylish Shoes for Girls Sneakers For Women      351
4       RED TAPE  Casual Sneaker Shoes for Men | Classic Rounded...    1,649
..           ...                                                ...      ...
95      URBANBOX  Stylish & Trending Outdoor Walking Comfortable...      749
96          aadi  Mesh |Lightweight|Comfort|Summer|Trendy|Walkin...      749
97  Jack Diamond                           sneaker Sneakers For Men      465
98      PROVOGUE                                   Sneakers For Men      370
99      Nobelite                                   Sneakers For Men      470

[100 rows x 3 columns]

Q5: Go to webpage https://www.amazon.in/ Enter “Laptop” in the search field and then click the search icon. Then set CPU 
Type filter to “Intel Core i7 After setting the filters scrape first 10 laptops data. You have to scrape 3 attributes for each laptop: 
1. Title 
2. Ratings 
3. Price”

In [31]:
# Opening Amazon on automated chrome
driver.get(' https://www.amazon.in/')

In [32]:
# Searching for laptop on amazon
product=driver.find_element(By.XPATH,'//input[@id="twotabsearchtextbox"]')
product.send_keys('Laptop')

In [33]:
search=driver.find_element(By.ID,"nav-search-submit-button")
search.click()

In [34]:
# Setting CPU filter to "intel core i7"
i7=driver.find_element(By.XPATH,'//li[@id="p_n_feature_thirteen_browse-bin/12598163031"]/span/a/div/label/i')
i7.click()

In [35]:
# scraping first 10 laptop data from amazon

# Creating blank list to store the scraped data
title=[]
rating=[]
price=[]
# scraping title of first 10 laptop results
title_tag=driver.find_elements(By.XPATH,'//h2[@class="a-size-mini a-spacing-none a-color-base s-line-clamp-2"]/a/span')
for t in title_tag[0:10]:
    title.append(t.text)

# scraping rating of first 10 laptop results
rating_tag=driver.find_elements(By.XPATH,'//div[@class="a-row a-size-small"]/span[1]')
for r in rating_tag[0:10]:
    rating.append(r.get_attribute("aria-label").replace('out of 5 stars',''))

# scraping price of first 10 laptop results
price_tag=driver.find_elements(By.XPATH,'//div[@class="a-section a-spacing-none a-spacing-top-micro puis-price-instructions-style"]/div/div/a/span')
for p in price_tag[0:10]:
    price.append(p.text.replace('₹',''))

print(len(title),len(rating),len(price))

10 10 10

In [36]:
# Creating a dataframe of scraped laptop data from amazon
df=pd.DataFrame({'Title':title,'Rating(Out of 5 stars)':rating,'Price(₹)':price})
df

,Title,Rating(Out of 5 stars),Price(₹)
0,"Dell Inspiron 7420 2in1 Laptop, Intel Core i7-...",4.0,"77,490"
1,Acer Aspire Lite 12th Gen Intel Core i7-1255U ...,3.8,"54,990"
2,"MSI Modern 14, Intel 12th Gen. i7-1255U, 36CM ...",4.0,"54,990"
3,Lenovo IdeaPad Slim 3 Intel Core i7 11th Gen 1...,3.1,"58,250"
4,"HP Laptop 15s, 12th Gen Intel Core i7-1255U, 1...",4.1,"63,990"
5,"ASUS TUF Gaming F15, 15.6""(39.62 cms) FHD 144H...",3.5,"72,990"
6,HP Pavilion 14 12th Gen Intel Core i7 16GB SDR...,4.4,"77,700"
7,"ASUS Vivobook 15, IntelCore i7-12650H 12th Gen...",4.2,"57,990"
8,Acer Travelmate Business Laptop Intel Core i7-...,3.7,"47,990"
9,Lenovo ThinkBook 15 Intel 12th Gen Core i7 15....,3.4,"59,990"

Q6: Write a python program to scrape data for Top 1000 Quotes of All Time. 
The above task will be done in following steps: 
1. First get the webpagehttps://www.azquotes.com/ 
2. Click on Top Quote 
3. Than scrap a) Quote b) Author c) Type Of Quotes

In [37]:
# opening azquotes on automated chrome
driver.get('https://www.azquotes.com/')

In [38]:
# Clicking on top quotes
top_quotes=driver.find_element(By.XPATH,'//div[@class="mainmenu"]/ul/li[5]')
top_quotes.click()

In [39]:
# Scraping 1000 quotes data from azquote

#creating blank list to store scraped data
quote=[]
author=[]
type=[]

#scraping data from 10 pages
for i in range(0,10):
    quote_tag=driver.find_elements(By.XPATH,'//div[@class="wrap-block"]/p/a[2]') # scraping quotes
    for q in quote_tag:
        quote.append(q.text)

    author_tag=driver.find_elements(By.XPATH,'//div[@class="author"]') # scraping author name of the quotes
    for a in author_tag:
        author.append(a.text)

    type_tag=driver.find_elements(By.XPATH,'//div[@class="tags"]') # scraping type of the quotes
    for t in type_tag:
        type.append(t.text)
        
    if len(quote)==1000:
        break
        
    next=driver.find_element(By.XPATH,'//li[@class="next"]')
    next.click() # Moving onto the next page
    time.sleep(20)

print(len(quote),len(author),len(type))

1000 1000 1000

In [40]:
# creating dataframe of scraped data
df=pd.DataFrame({'Quotes':quote,'Author-Name':author,'Type of quotes':type})
df

,Quotes,Author-Name,Type of quotes
0,The essence of strategy is choosing what not t...,Michael Porter,"Essence, Deep Thought, Transcendentalism"
1,One cannot and must not try to erase the past ...,Golda Meir,"Inspiration, Past, Trying"
2,Patriotism means to stand by the country. It d...,Theodore Roosevelt,"Country, Peace, War"
3,Death is something inevitable. When a man has ...,Nelson Mandela,"Inspirational, Motivational, Death"
4,You have to love a nation that celebrates its ...,Erma Bombeck,"4th Of July, Food, Patriotic"
...,...,...,...
995,Regret for the things we did can be tempered b...,Sydney J. Harris,"Love, Inspirational, Motivational"
996,America... just a nation of two hundred millio...,Hunter S. Thompson,"Gun, Two, Qualms About"
997,For every disciplined effort there is a multip...,Jim Rohn,"Inspirational, Greatness, Best Effort"
998,"The spiritual journey is individual, highly pe...",Ram Dass,"Spiritual, Truth, Yoga"
999,The mind is not a vessel to be filled but a fi...,Plutarch,"Inspirational, Leadership, Education"

Q7: Write a python program to display list of respected former Prime Ministers of India (i.e. Name, 
Born-Dead, Term of office, Remarks) from https://www.jagranjosh.com/general-knowledge/list-of
all-prime-ministers-of-india-1473165149-1  
scrap the mentioned data and make the DataFrame

In [41]:
# opening the given jagaranjosh link on automated chrome
driver.get('https://www.jagranjosh.com/general-knowledge/list-of all-prime-ministers-of-india-1473165149-1')

In [42]:
# Scraping data from given link

# creating blank list to store the scraped data
name=[]
born_dead=[]
office_term=[]
remarks=[]

# Scraping Prime Ministers of India Names
name_tag=driver.find_elements(By.XPATH,'//table[@border="1"]/tbody/tr/td[2]/div')
for n in name_tag:
    name.append(n.text)

# Scraping Born-Dead year of the Prime Ministers
b_d_tag=driver.find_elements(By.XPATH,'//table[@border="1"]/tbody/tr/td[3]')
for b in b_d_tag:
    born_dead.append(re.sub('[()]','',b.text))

# scraping term of office of the Prime Ministers
term_tag=driver.find_elements(By.XPATH,'//table[@border="1"]/tbody/tr/td[4]')
for t in term_tag:
    office_term.append(t.text.replace('\n',' '))

# scraping remarks
remark_tag=driver.find_elements(By.XPATH,'//table[@border="1"]/tbody/tr/td[5]')
for r in remark_tag:
    remarks.append(r.text)

print(len(name),len(born_dead),len(office_term),len(remarks))

19 19 19 19

In [43]:
# creating dataframe of the scraped data
df=pd.DataFrame({'Name':name,'Born-Dead':born_dead,'Term of Office':office_term,'Remarks':remarks})
df

,Name,Born-Dead,Term of Office,Remarks
0,Jawahar Lal Nehru,1889–1964,"15 August 1947 to 27 May 1964 16 years, 286 days",The first prime minister of India and the long...
1,Gulzarilal Nanda (Acting),1898-1998,"27 May 1964 to 9 June 1964, 13 days",First acting PM of India
2,Lal Bahadur Shastri,1904–1966,"9 June 1964 to 11 January 1966 1 year, 216 days",He has given the slogan of 'Jai Jawan Jai Kisa...
3,Gulzari Lal Nanda (Acting),1898-1998,11 January 1966 to 24 January 1966 13 days,-
4,Indira Gandhi,1917–1984,"24 January 1966 to 24 March 1977 11 years, 59 ...",First female Prime Minister of India
5,Morarji Desai,1896–1995,"24 March 1977 to 28 July 1979 2 year, 126 days",Oldest to become PM (81 years old) and first t...
6,Charan Singh,1902–1987,28 July 1979 to 14 January 1980 170 days,Only PM who did not face the Parliament
7,Indira Gandhi,1917–1984,"14 January 1980 to 31 October 1984 4 years, 29...",The first lady who served as PM for the second...
8,Rajiv Gandhi,1944–1991,"31 October 1984 to 2 December 1989 5 years, 32...",Youngest to become PM (40 years old)
9,V. P. Singh,1931–2008,2 December 1989 to 10 November 1990 343 days,First PM to step down after a vote of no confi...
10,Chandra Shekhar,1927–2007,10 November 1990 to 21 June 1991 223 days,He belongs to Samajwadi Janata Party
11,P. V. Narasimha Rao,1921–2004,"21 June 1991 to 16 May 1996 4 years, 330 days",First PM from South India
12,Atal Bihari Vajpayee,1924- 2018,16 May 1996 to 1 June 1996 16 days,PM for shortest tenure
13,H. D. Deve Gowda,born 1933,1 June 1996 to 21 April 1997 324 days,He belongs to Janata Dal
14,Inder Kumar Gujral,1919–2012,21 April 1997 to 19 March 1998 332 days,------
15,Atal Bihari Vajpayee,1924-2018,"19 March 1998 to 22 May 2004 6 years, 64 days",The first non-congress PM who completed a ful...
16,Manmohan Singh,born 1932,"22 May 2004 to 26 May 2014 10 years, 4 days",First Sikh PM
17,Narendra Modi,born 1950,26 May 2014 - 2019,4th Prime Minister of India who served two con...
18,Narendra Modi,born 1950,30 May 2019- Incumbent,First non-congress PM with two consecutive ten...

Q8: Write a python program to display list of 50 Most expensive cars in the world 
(i.e. Car name and Price) from https://www.motor1.com/  
This task will be done in following steps: 
1. First get the webpage https://www.motor1.com/ 
2. Then You have to type in the search bar ’50 most expensive cars’ 
3. Then click on 50 most expensive cars in the world.. 
4. Then scrap the mentioned data and make the dataframe.

In [44]:
# opening the given webpage on autumated chrome
driver.get(' https://www.motor1.com/')

In [51]:
# searching for 50 most expensive cars in the world
input=driver.find_element(By.XPATH,'//input[@class="m1-search-panel-input m1-search-form-text"]')
input.send_keys('50 most expensive cars')

In [52]:
search=driver.find_element(By.XPATH,'//button[@class="m1-search-panel-button m1-search-form-button-animate icon-search-svg"]')
search.click()

In [53]:
result=driver.find_element(By.XPATH,'//div[@class="item wcom "]/div/div[1]/h3')
result.click()

In [54]:
# scraping the data of 50 most expensive cars in the world from giveb webpage

# creating blank lists
car_name=[]
price=[]

# scraping name of 50 most expensive car in the world
name_tag=driver.find_elements(By.XPATH,'//h3[@class="subheader"]')
for n in name_tag[0:50]:
    car_name.append(n.text)

# scraping price of the 50 most expensive car in the world
price_tag=driver.find_elements(By.XPATH,'//div[@class="postBody description e-content"]/p/strong')
for p in price_tag:
    price.append(p.text.replace('Price: ',''))

print(len(car_name),len(price))

50 50

In [55]:
# creating a dataframe of the scraped data of 50 most expensive car in the world from given webpage
df=pd.DataFrame({'Car Name':car_name,'Price':price})
df

                              Car Name                 Price
0                  Aston Martin Valour          $1.5 Million
1                         McLaren Elva          $1.7 Million
2                          Czinger 21C          $1.7 Million
3                        Ferrari Monza          $1.7 Million
4                   Gordon Murray T.33          $1.7 Million
5                    Koenigsegg Gemera          $1.7 Million
6                          Zenvo TSR-S          $1.7 Million
7                   Hennessey Venom F5          $1.8 Million
8                      Bentley Bacalar          $1.9 Million
9        Hispano Suiza Carmen Boulogne          $1.9 Million
10              Bentley Mulliner Batur          $2.0 Million
11                        Deus Vayanne          $2.0 Million
12                         SSC Tuatara          $2.0 Million
13                         Lotus Evija          $2.1 Million
14                 Aston Martin Vulcan          $2.3 Million
15                          Delage D12          $2.3 Million
16                 Ferrari Daytona SP3          $2.3 Million
17                   McLaren Speedtail          $2.3 Million
18                        Rimac Nevera          $2.4 Million
19                       Pagani Utopia          $2.5 Million
20                Pininfarina Battista          $2.5 Million
21                  Gordon Murray T.50          $2.6 Million
22                Lamborghini Countach          $2.6 Million
23            Mercedes-AMG Project One          $2.7 Million
24                        Zenvo Aurora          $2.8 Million
25                 Aston Martin Victor          $3.0 Million
26         Hennessey Venom F5 Roadster          $3.0 Million
27                    Koenigsegg Jesko          $3.0 Million
28               Aston Martin Valkyrie          $3.2 Million
29           W Motors Lykan Hypersport          $3.4 Million
30                       McLaren Solus          $3.5 Million
31                    Lamborghini Sian          $3.6 million
32                    Koenigsegg CC850          $3.7 Million
33     Bugatti Chiron Super Sport 300+          $3.9 Million
34                  Lamborghini Veneno          $4.5 Million
35                      Bugatti Bolide          $4.7 Million
36           Pininfarina B95 Speedster          $4.8 Million
37                     Bugatti Mistral          $5.0 Million
38                 Pagani Huayra Imola          $5.4 Million
39                        Bugatti Divo          $5.8 Million
40                 SP Automotive Chaos          $6.4 Million
41                    Pagani Codalunga          $7.4 Million
42                        777 Hypercar          $7.5 Million
43            Mercedes-Maybach Exelero          $8.0 Million
44                  Bugatti Centodieci          $9.0 Million
45             Bugatti Chiron Profilée         $10.8 Million
46                Rolls-Royce Sweptail         $12.8 Million
47            Bugatti La Voiture Noire         $13.4 Million
48              Rolls-Royce Boat Tail*  $28.0 Million (est.)
49  Rolls-Royce La Rose Noire Droptail    $30 Million (est.)